In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
        "name":["Ravi", "Kumar", "Shivay", "Pranjal", "Abhay"],
        "marks":[56,55,79,21,39],
        "city":["Agra","Mumbai","Jaipur","Surat","Ahmedabad"],
        }

# DataFrame

In [3]:
df = pd.DataFrame(dict) # converts into Dataframe means excelsheet

In [4]:
df

      name  marks       city
0     Ravi     56       Agra
1    Kumar     55     Mumbai
2   Shivay     79     Jaipur
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [5]:
# df.to_csv("hello.csv") # used to convert table into csv

In [6]:
# df.to_csv("hello.csv", index=False) # used to convert table into csv without index

In [7]:
df.head(2) # used to show data from top

    name  marks    city
0   Ravi     56    Agra
1  Kumar     55  Mumbai

In [8]:
df.tail(2) # used to show data from down

      name  marks       city
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [9]:
df.describe()

           marks
count   5.000000
mean   50.000000
std    21.587033
min    21.000000
25%    39.000000
50%    55.000000
75%    56.000000
max    79.000000

In [10]:
check = pd.read_csv('Marks.csv')

In [11]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  53.018
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [12]:
check['Marks']

0      19.202
1       7.734
2      13.811
3      53.018
4      55.299
        ...
96      5.609
97     41.444
98     12.027
99     32.357
100       NaN
Name: Marks, Length: 101, dtype: float64

In [13]:
check['Marks'][30] # index value

np.float64(24.172)

In [14]:
check['Marks'][3]=51.22 # change the value

C:\Users\asus\AppData\Local\Temp\ipykernel_11780\1440393980.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  check['Marks'][3]=51.22 # change the value

In [15]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  51.220
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [16]:
df.index=['a','b','c','d','e'] # used to change index type

In [17]:
df

      name  marks       city
a     Ravi     56       Agra
b    Kumar     55     Mumbai
c   Shivay     79     Jaipur
d  Pranjal     21      Surat
e    Abhay     39  Ahmedabad

In [18]:
 ser=pd.Series(np.random.rand(15)) # Random 15 value in series

In [19]:
ser

0     0.879013
1     0.774714
2     0.382984
3     0.358664
4     0.194052
5     0.127274
6     0.380083
7     0.057343
8     0.571789
9     0.194860
10    0.180277
11    0.718448
12    0.271755
13    0.732035
14    0.391765
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [21]:
newdf = pd.DataFrame(np.random.rand(200,4), index=np.arange(200))

In [22]:
newdf

            0         1         2         3
0    0.729197  0.556687  0.631552  0.585260
1    0.868507  0.785743  0.175512  0.694567
2    0.822208  0.744107  0.227535  0.365293
3    0.532031  0.597825  0.118601  0.758545
4    0.588473  0.578572  0.141241  0.311850
..        ...       ...       ...       ...
195  0.564493  0.277811  0.859118  0.562677
196  0.427890  0.171114  0.052671  0.220600
197  0.935848  0.029109  0.988949  0.095576
198  0.444296  0.735681  0.591622  0.298560
199  0.283914  0.155606  0.802603  0.650699

[200 rows x 4 columns]

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [25]:
newdf

            0         1         2         3
0    0.729197  0.556687  0.631552  0.585260
1    0.868507  0.785743  0.175512  0.694567
2    0.822208  0.744107  0.227535  0.365293
3    0.532031  0.597825  0.118601  0.758545
4    0.588473  0.578572  0.141241  0.311850
..        ...       ...       ...       ...
195  0.564493  0.277811  0.859118  0.562677
196  0.427890  0.171114  0.052671  0.220600
197  0.935848  0.029109  0.988949  0.095576
198  0.444296  0.735681  0.591622  0.298560
199  0.283914  0.155606  0.802603  0.650699

[200 rows x 4 columns]

In [26]:
newdf

            0         1         2         3
0    0.729197  0.556687  0.631552  0.585260
1    0.868507  0.785743  0.175512  0.694567
2    0.822208  0.744107  0.227535  0.365293
3    0.532031  0.597825  0.118601  0.758545
4    0.588473  0.578572  0.141241  0.311850
..        ...       ...       ...       ...
195  0.564493  0.277811  0.859118  0.562677
196  0.427890  0.171114  0.052671  0.220600
197  0.935848  0.029109  0.988949  0.095576
198  0.444296  0.735681  0.591622  0.298560
199  0.283914  0.155606  0.802603  0.650699

[200 rows x 4 columns]

In [29]:
newdf[2][2]= "Shiv"

In [30]:
newdf

            0         1         2         3
0    0.729197  0.556687  0.631552  0.585260
1    0.868507  0.785743  0.175512  0.694567
2    0.822208  0.744107      Shiv  0.365293
3    0.532031  0.597825      Shiv  0.758545
4    0.588473  0.578572  0.141241  0.311850
..        ...       ...       ...       ...
195  0.564493  0.277811  0.859118  0.562677
196  0.427890  0.171114  0.052671  0.220600
197  0.935848  0.029109  0.988949  0.095576
198  0.444296  0.735681  0.591622  0.298560
199  0.283914  0.155606  0.802603  0.650699

[200 rows x 4 columns]

In [31]:
newdf.dtypes

0    float64
1    float64
2     object
3    float64
dtype: object

In [32]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       190, 191, 192, 193, 194, 195, 196, 197, 198, 199],
      dtype='int64', length=200)

In [33]:
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [34]:
newdf[2][2]= 3.3

In [35]:
newdf

            0         1         2         3
0    0.729197  0.556687  0.631552  0.585260
1    0.868507  0.785743  0.175512  0.694567
2    0.822208  0.744107       3.3  0.365293
3    0.532031  0.597825      Shiv  0.758545
4    0.588473  0.578572  0.141241  0.311850
..        ...       ...       ...       ...
195  0.564493  0.277811  0.859118  0.562677
196  0.427890  0.171114  0.052671  0.220600
197  0.935848  0.029109  0.988949  0.095576
198  0.444296  0.735681  0.591622  0.298560
199  0.283914  0.155606  0.802603  0.650699

[200 rows x 4 columns]

In [36]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
0,0.729197,0.868507,0.822208,0.532031,0.588473,0.621262,0.93017,0.763173,0.106123,0.505898,...,0.345365,0.507851,0.563157,0.302286,0.723321,0.564493,0.42789,0.935848,0.444296,0.283914
1,0.556687,0.785743,0.744107,0.597825,0.578572,0.001692,0.639116,0.603347,0.647412,0.776905,...,0.859796,0.95328,0.797912,0.24657,0.366133,0.277811,0.171114,0.029109,0.735681,0.155606
2,0.631552,0.175512,3.3,Shiv,0.141241,0.273991,0.436816,0.234062,0.974652,0.52355,...,0.484143,0.265177,0.553997,0.229767,0.459054,0.859118,0.052671,0.988949,0.591622,0.802603
3,0.58526,0.694567,0.365293,0.758545,0.31185,0.942114,0.562389,0.875536,0.27746,0.074419,...,0.038184,0.641243,0.186167,0.764868,0.307909,0.562677,0.2206,0.095576,0.29856,0.650699

In [37]:
newdf.head()

          0         1         2         3
0  0.729197  0.556687  0.631552  0.585260
1  0.868507  0.785743  0.175512  0.694567
2  0.822208  0.744107       3.3  0.365293
3  0.532031  0.597825      Shiv  0.758545
4  0.588473  0.578572  0.141241  0.311850